Revit 2027 API
CurtainGridAlignType Enumeration
An enumerated to list CurtainGrid patterns.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CurtainGridAlignType
Public Enumeration CurtainGridAlignType
public enum class CurtainGridAlignType
type CurtainGridAlignType
Members
Member name | Value | Description
Beginning | 1 |  Beginning pattern of CurtainGrid.
Center | 2 |  Center pattern of CurtainGrid.
End | 3 |  End pattern of CurtainGrid.
NoJustify | 0 |  NoJustify.
See Also
Reference
Autodesk.Revit.DB Namespace